Core/src/src/InformationRegisters/РетроБонуси/РетроБонуси.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонуси</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РетроБонус</name>
    <type>
      <types>CatalogRef.РетроБонусыИПроцентМаркетинговогоБюджета</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПроцентаРетроБонуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентМаркетинговогоБюджета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РозничнаяВесовая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АктивностьСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/РетроБонуси/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура установитьНалогообложениеНДС(НоменклатураСсылка)
	
	НоменклатураОб = НоменклатураСсылка.ПолучитьОбъект();
	
	Если НоменклатураОб.СтавкаНДС = Справочники.СтавкиНДС.НДС18 Тогда 
		Запись.НалогообложениеНДС = НСТР("ru = ' НДС 18% '; ka = 'დასაბეგრი'");
	ИначеЕсли  НоменклатураОб.СтавкаНДС = Справочники.СтавкиНДС.ОсвобожденОтНДС Тогда 
		Запись.НалогообложениеНДС = НСТР("ru = 'Освобожден от НДС'; ka = 'დაუბეგრავი'");		
	ИначеЕсли  НоменклатураОб.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда 
		Запись.НалогообложениеНДС = НСТР("ru = '(-)'; ka = '(-)'");
	иначе
		Запись.НалогообложениеНДС = НСТР("ru = '(-)'; ka = '(-)'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	установитьНалогообложениеНДС(ВыбранноеЗначение);

КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорПоУмолчанию(КонтрагентСсылка)
	
	КонтрагентОб = КонтрагентСсылка.ПолучитьОбъект();		
	ДоговорПоУмолчанию = КонтрагентОб.ДоговорПоУмолчанию;		
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Запись.Контрагент);
	Запись.ДоговорКонтрагента = ДоговорПоУмолчанию;

КонецПроцедуры
